# # Получаем массу
# m = 10
# v = 10.0
#
# print((m * v ** 2) / 2)

# x1 = -1
# y1 = 3
# x2 = 6
# y2 = 2
#
# x = (x2-x1) ** 2
# y = (y2-y1) ** 2
#
# print(((x2 - x1) ** 2 + (y2 - y1) ** 2) ** .5)
# print(((x2 - x1) ** 2 + (y2 - y1) ** 2) ** .5)
#
# digit = 34 / 14
# print(round(digit, 2))

# ----------------
# Напишите программу, которая получает из stdin два целых числа: доход и процент
# налога, который должен быть удержан с дохода. После программа должна вычислить
# доход за вычетом налога и вывести результат с двумя знаками после десятичной точки.

# income = int(input())
# tax_percentage = int(input())
#
# tax = income * tax_percentage / 100
#
# print(round(income - tax, 2))

# ----------------


usd = 80.9657
eur = 86.5

print(round(eur))